[
{
	"id": "crs/0",
	"body": "The signs that God showed to Moses at his call were meant to",
	"options": {
		"a": "convince Pharaoh that he was the prophet of God.",
		"b": "portray him as superior to the Egyptian magicians.",
		"c": "enable him to perform miracles before Pharaoh.",
		"d": "convince the people that he has been sent by God."
	},
	"answer": "d",
	"explanation": "Reference: Exodus 4 : 1 – 8"
},
{
	"id": "crs/1",
	"body": "“The LORD give you children by this woman...”\nEli offered this prayer because of Hannah’s",
	"options": {
		"a": "loan of Samuel to the LORD.",
		"b": "faith in God.",
		"c": "love for the service of the LORD.",
		"d": "desire for more children from God."
	},
	"answer": "a",
	"explanation": "Reference: 1 Samuel 2 : 20\n[20] Then Eli would bless Elka'nah and his wife, and say, “The LORD give you children by this woman for the loan which she lent to the LORD”; so then they would return to their home."
},
{
	"id": "crs/2",
	"body": "“All the words which the LORD has spoken we will do...”\nWhat was Moses’ response to this declaration by the Israelites?",
	"options": {
		"a": "He asked them to pick twelve stones to represent the tribes.",
		"b": "He charged them to walk faithfully before the LORD.",
		"c": "He offered peace offerings to the LORD.",
		"d": "He said that the LORD was witness to their declaration."
	},
	"answer": "c",
	"explanation": "Reference: Exodus 24 : 3 – 6."
},
{
	"id": "crs/3",
	"body": "King Saul asked Jesse to send David to him because he wanted David to",
	"options": {
		"a": "kill Goliath",
		"b": "serve him",
		"c": "marry his daughter, Michal",
		"d": "become Jonathan’s friend"
	},
	"answer": "b",
	"explanation": "Reference: 1 Samuel 16 : 18 - 22"
},
{
	"id": "crs/4",
	"body": "King Rehoboam refused to take the counsel of the elders because",
	"options": {
		"a": "it was wrong counsel",
		"b": "he was afraid of the outcome of their counsel",
		"c": "it was a turn of affairs brought about by the LORD",
		"d": "he was stubborn"
	},
	"answer": "c"
}
]